smartcartech/SmartCarTech_Web/ate-automation/src/FW_v03.00.09_ESP32_3USB_3DLC_OTA.cpp
const int addrUsbA[3] = {0, 8, 16};
const int addrUsbB[3] = {4, 12, 20};
const int addrTimeD   = 24; 
const int addrTimeC   = 28; 

// EEPROM metadata cho version LittleFS HTTPS OTA.
// Các địa chỉ cũ 0..31 giữ nguyên hoàn toàn.
const int addrFsVersionCode  = 32;
const int addrFsVersionMagic = 36;
const uint32_t FS_VERSION_MAGIC = 0x46535631UL; // ASCII gần tương đương "FSV1"

int currentScreen = 1; 
int cursorIndex = 0; 
bool isRunning = false;
bool isRunManually = false; 
bool skipManualKeyTest = false; // false = AUTO (test 11 keys), true = AUTO2 (skip key test)
unsigned long previousMillis = 0;
int runStep = 6; // Mặc định chạy ở Step 6 (Chờ PC Command)

bool lastOk = HIGH, lastDown = HIGH, lastPlus = HIGH, lastMinus = HIGH, lastRun = HIGH;

// ==========================================
// BIẾN CHO WIFI SETTING (CONFIG PORTAL KHÔNG BLOCKING)
// ==========================================
// WiFiManager chỉ mở AP cấu hình khi user chủ động vào "Wifi Setting".
// Khi BOOT thất bại, ESP32 KHÔNG tự phát AP cấu hình.
WiFiManager wifiManager;
bool wifiPortalActive = false;
bool wifiExitConfirm = false;
int wifiExitSelection = 0; // 0 = No (mặc định an toàn), 1 = Yes

// JavaScript được WiFiManager chèn vào <head> của portal.
// Chỉ redirect khi đang ở trang root "/"; trang /wifi sẽ không redirect tiếp,
// vì vậy không tạo vòng lặp. Dùng URL tuyệt đối HTTP để tránh browser
// tự nâng link Configure WiFi thành HTTPS.
const char WIFI_PORTAL_DIRECT_WIFI_PAGE[] =
  "<script>"
  "if(window.location.pathname==='/' ){"
  "window.location.replace('http://192.168.4.1/wifi');"
  "}"
  "</script>";

const unsigned long WIFI_BOOT_CONNECT_TIMEOUT_MS = 10000UL; // Chỉ chờ Wi-Fi cũ 10 giây khi BOOT

// Khai báo trước hàm
void printCentered(int row, String text);
void drawScreen();
void handleRunSequence();
void handleSerialCommands();
void trigger11Keys();
void detachServoSafe(int index);
void safeStopAll(); 
void updateFirmwareFromInternet(); // HTTPS OTA: Firmware + LittleFS
void setupArduinoOTA();
void startWifiSettingPortal();
void stopWifiSettingPortalAndReturn();
void drawWifiSettingScreen();
void drawWifiExitConfirmScreen();

// Audio
void setupAudio();
void audioTask(void* parameter);
void requestButtonBeep();
void queueVoice(const char* filePath);
void queueToolVoice(int toolIndex);
void playButtonBeepInternal();
bool playVoiceWavInternal(const char* filePath);
bool parseWavHeader(File& file, uint32_t& sampleRate, uint16_t& channels, uint16_t& bitsPerSample, uint32_t& dataSize);
uint16_t readLE16(const uint8_t* p);
uint32_t readLE32(const uint8_t* p);
bool pauseAudioAndUnmountLittleFSForOta();
void resumeAudioAfterFilesystemOtaError();
void writeAudioSilence();

// HTTPS OTA / filesystem version metadata
void loadInstalledFsVersion();
void saveInstalledFsVersion(uint32_t versionCode);
String versionCodeToName(uint32_t versionCode);

void setup() {
  USB.VID(0x1720); 
  USB.PID(0xAE01); 
  USB.productName("ATE Test System"); 
  USB.manufacturerName("INNOVA Automation");
  USB.firmwareVersion(0x100); 
  
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  for (int i = 0; i < 3; i++) {
    usbServos[i].setPeriodHertz(50); 
  }

  USBSerial.begin(115200); 
  USB.begin();

  // Khởi tạo I2S + LittleFS + audio task trước MCP23017 để nếu MCP lỗi
  // vẫn có thể phát voice "Hardware initialization error".
  setupAudio();

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  lcd.init();
  lcd.backlight();

  if (!mcp.begin_I2C(0x20)) {
    lcd.setCursor(0, 0); lcd.print("Loi Phan Cung!");
    queueVoice(VOICE_HARDWARE_ERROR);
    while (1) { delay(1000); } // Halt hệ thống nhưng vẫn nhường CPU cho audio task.
  }
  
  for (int i = 0; i < 16; i++) {
    mcp.pinMode(i, OUTPUT);
    mcp.digitalWrite(i, HIGH); 
  }

  EEPROM.begin(64);
  for (int i = 0; i < 3; i++) {
    EEPROM.get(addrUsbA[i], usbAngleA[i]); 
    EEPROM.get(addrUsbB[i], usbAngleB[i]);
    if(usbAngleA[i] < 0 || usbAngleA[i] > 180) usbAngleA[i] = 20; 
    if(usbAngleB[i] < 0 || usbAngleB[i] > 180) usbAngleB[i] = 40; 
  }

  EEPROM.get(addrTimeD, delayDisconnect);
  EEPROM.get(addrTimeC, delayConnect); 
  if(delayDisconnect < 0 || delayDisconnect > 1000) delayDisconnect = 3; 
  if(delayConnect < 8 || delayConnect > 1000) delayConnect = 8; 

  // Đọc version LittleFS đã cài từ EEPROM. Không dùng compile-time constant
  // để tránh download lại filesystem sau mỗi lần reboot.
  loadInstalledFsVersion();

  pinMode(BTN_OK, INPUT_PULLUP); 
  pinMode(BTN_DOWN, INPUT_PULLUP);
  pinMode(BTN_PLUS, INPUT_PULLUP); 
  pinMode(BTN_MINUS, INPUT_PULLUP);
  pinMode(BTN_RUN, INPUT_PULLUP);

  // ==========================================
  // MÀN HÌNH KHỞI ĐỘNG (CÓ HIỂN THỊ VERSION)
  // ==========================================
  lcd.setCursor(6, 1); lcd.print("INNOVA");
  delay(1000); 
  
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print(" INNOVA Automation");
  
  // Hiển thị Firmware Version ra giữa màn hình
  lcd.setCursor(1, 2); 
  lcd.print("Firmware V"); 
  lcd.print(CURRENT_VERSION);

  lcd.setCursor(0, 3); lcd.print("- Design by TuanLe -");
  delay(3000); 

  // ==========================================================
  // WIFI KHI BOOT
  // - Chỉ thử kết nối Wi-Fi đã lưu.
  // - Nếu không kết nối được: chạy Offline.
  // - KHÔNG tự phát AP "ATE_Setup_WiFi" khi BOOT.
  // - Muốn đổi/cấu hình Wi-Fi: user vào Function -> Wifi Setting.
  // ==========================================================
  lcd.clear();
  printCentered(0, "WIFI CONNECTION");
  lcd.setCursor(0, 1); lcd.print("Connecting...");

  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin(); // Dùng SSID/password đã lưu trong NVS của ESP32

  unsigned long wifiStartMillis = millis();
  while (WiFi.status() != WL_CONNECTED &&
         millis() - wifiStartMillis < WIFI_BOOT_CONNECT_TIMEOUT_MS) {
    delay(250);
  }

  if (WiFi.status() == WL_CONNECTED) {
    lcd.clear();
    printCentered(0, "WIFI CONNECTED!");
    lcd.setCursor(0, 1); lcd.print("IP:");
    lcd.print(WiFi.localIP());
    delay(1500);

    setupArduinoOTA();
    updateFirmwareFromInternet();

  } else {
    lcd.clear();
    printCentered(1, "WIFI FAILED!");
    lcd.setCursor(0, 2); lcd.print("Running Offline Mode");
    queueVoice(VOICE_WIFI_FAILED);
    delay(2000);
  }

  // KHỞI ĐỘNG VÀO CHỜ PC MODE
  isRunning = true;         
  isRunManually = false;    
  currentPair = 0;
  runStep = 6;              
  
  lcd.clear();
  printCentered(0, "SYSTEM RUN (PC)");
  lcd.setCursor(0, 1); lcd.print("Tool: 1");
  lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
  lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");

  currentScreen = 2; 

  // Voice quan trọng khi hệ thống đã hoàn tất boot và sẵn sàng.
  queueVoice(VOICE_SYSTEM_READY);
}

void loop() {
  // WiFiManager portal chạy NON-BLOCKING để vẫn đọc được button OK/DOWN.
  if (wifiPortalActive) {
    wifiManager.process();

    // Vì đã chủ động disconnect Wi-Fi cũ trước khi mở portal,
    // WL_CONNECTED ở đây nghĩa là user đã chọn Wi-Fi và kết nối thành công.
    if (!wifiExitConfirm && WiFi.status() == WL_CONNECTED) {
      wifiPortalActive = false;
      wifiManager.stopConfigPortal();

      lcd.clear();
      printCentered(1, "WiFi Updated!");
      lcd.setCursor(0, 2); lcd.print("Rebooting...");
      delay(2000);
      ESP.restart();
    }
  }

  if (WiFi.status() == WL_CONNECTED && !wifiPortalActive) {
    ArduinoOTA.handle(); 
  }

