smartcartech/SmartCarTech_Web/ate-automation/src/FW_v03.00.09_ESP32_3USB_3DLC_OTA.cpp
  handleSerialCommands();

  bool ok    = digitalRead(BTN_OK);
  bool down  = digitalRead(BTN_DOWN);
  bool plus  = digitalRead(BTN_PLUS);
  bool minus = digitalRead(BTN_MINUS);
  bool run   = digitalRead(BTN_RUN);

  // ======================================================
  // BUTTON SOUND
  // Chỉ beep khi có cạnh nhấn mới của 5 nút vật lý.
  // Không dùng beep cho USB/DLC/Tool change/Warning/Error.
  // ======================================================
  if (ok    == LOW && lastOk    == HIGH) requestButtonBeep();
  if (down  == LOW && lastDown  == HIGH) requestButtonBeep();
  if (plus  == LOW && lastPlus  == HIGH) requestButtonBeep();
  if (minus == LOW && lastMinus == HIGH) requestButtonBeep();
  if (run   == LOW && lastRun   == HIGH) requestButtonBeep();

  if (!wifiPortalActive && run == LOW && lastRun == HIGH) {
    if (isRunning) {
      safeStopAll(); 
      queueVoice(VOICE_AUTOMATION_STOPPED);
      isRunning = false; 
      currentScreen = 2;
      cursorIndex = 0;
      drawScreen(); 
    } else {
      isRunning = true; 
      isRunManually = false; 
      skipManualKeyTest = false;
      currentPair = 0; 
      runStep = 6; 
      lcd.clear();
      printCentered(0, "SYSTEM RUN (PC)");
      lcd.setCursor(0, 1); lcd.print("Tool: 1");
      lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
      lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");
    }
    delay(150); 
  }

  if (isRunning) { handleRunSequence(); goto UPDATE_STATE; }

  // THUẬT TOÁN CUỘN TRANG CẬP NHẬT CHO 5 MỤC MENU
  if (down == LOW && lastDown == HIGH) {
    if (wifiPortalActive && wifiExitConfirm) {
      // Ở màn hình xác nhận thoát WiFi Setting:
      // DOWN dùng để đổi giữa No <-> Yes.
      wifiExitSelection = (wifiExitSelection + 1) % 2;
      drawWifiExitConfirmScreen();
    }
    else if (currentScreen == 2) {
      cursorIndex = (cursorIndex + 1) % 5; 
      drawScreen();
    }
    else if (currentScreen >= 4 && currentScreen <= 6) {
      cursorIndex = (cursorIndex + 1) % 2; 
      drawScreen();
    }
    else if (currentScreen == 10) {
      // Run Manually submenu: Include Key Test / Skip Key Test
      cursorIndex = (cursorIndex + 1) % 2;
      drawScreen();
    }
    delay(150);
  }

  if (ok == LOW && lastOk == HIGH) {
    // ======================================================
    // WIFI SETTING: OK -> hỏi có muốn thoát hay không
    // ======================================================
    if (wifiPortalActive) {
      if (!wifiExitConfirm) {
        wifiExitConfirm = true;
        wifiExitSelection = 0; // Mặc định = No để tránh thoát nhầm.
        drawWifiExitConfirmScreen();
      } else {
        if (wifiExitSelection == 1) {
          // Yes -> đóng AP cấu hình và quay lại Function.
          stopWifiSettingPortalAndReturn();
        } else {
          // No -> quay lại màn hình WiFi Setting, portal vẫn tiếp tục chạy.
          wifiExitConfirm = false;
          drawWifiSettingScreen();
        }
      }

      delay(150);
      goto UPDATE_STATE;
    }

    if (currentScreen == 2) {
      if (cursorIndex == 0) {
        // Run Manually -> chọn có test 11 keys hay bỏ qua key test.
        currentScreen = 10;
        cursorIndex = 0;
      }
      else if (cursorIndex == 1) { currentScreen = 4; cursorIndex = 0; } 
      else if (cursorIndex == 2) { currentScreen = 9; cursorIndex = 0; } 
      else if (cursorIndex == 3) { currentScreen = 8; cursorIndex = 0; } 
      else if (cursorIndex == 4) { 
        // =======================================
        // CHỨC NĂNG ĐỔI WIFI TỪ MENU
        // =======================================
        // Không timeout. Portal chạy non-blocking để button OK/DOWN vẫn hoạt động.
        startWifiSettingPortal();
        delay(150);
        goto UPDATE_STATE;
      }
    } 
    else if (currentScreen == 10) {
      isRunning = true;
      isRunManually = true;
      skipManualKeyTest = (cursorIndex == 1);
      currentPair = 0;

      runStep = 2;
      previousMillis = millis();

      lcd.clear();
      if (skipManualKeyTest) printCentered(0, "SYSTEM RUN (AUTO2)");
      else                   printCentered(0, "SYSTEM RUN (AUTO)");
      lcd.setCursor(0, 1); lcd.print("Tool: 1");
      lcd.setCursor(0, 2); lcd.print("Wait Disconnect...  ");
      lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");

      // Voice mode + Tool 1. Không có voice "Automatic test completed"
      // vì AUTO/AUTO2 hiện chạy vòng liên tục 1 -> 2 -> 3 -> 1.
      if (skipManualKeyTest) queueVoice(VOICE_AUTO_SKIP_KEY);
      else                   queueVoice(VOICE_AUTO_WITH_KEY);
      queueToolVoice(0);

      delay(150);
      goto UPDATE_STATE;
    }
    else if (currentScreen == 4) { currentScreen = 5; cursorIndex = 0; }
    else if (currentScreen == 5) { currentScreen = 6; cursorIndex = 0; }
    else if (currentScreen == 6 || currentScreen == 8 || currentScreen == 9) {
       for (int i = 0; i < 3; i++) {
         EEPROM.put(addrUsbA[i], usbAngleA[i]); 
         EEPROM.put(addrUsbB[i], usbAngleB[i]);
       }
       EEPROM.put(addrTimeD, delayDisconnect);
       EEPROM.put(addrTimeC, delayConnect);
       EEPROM.commit(); 
       currentScreen = 2; cursorIndex = 0; 
    }
    drawScreen(); delay(150);
  }

  if (plus == LOW && lastPlus == HIGH) {
    if (currentScreen >= 4 && currentScreen <= 6) {
      int t = currentScreen - 4; 
      if (cursorIndex == 0) usbAngleA[t] = min(180, usbAngleA[t] + 1); 
      else usbAngleB[t] = min(180, usbAngleB[t] + 1); 
      drawScreen();
    } 
    else if (currentScreen == 8) { delayDisconnect++; drawScreen(); }
    else if (currentScreen == 9) { delayConnect++; drawScreen(); }
    delay(100);
  }

  if (minus == LOW && lastMinus == HIGH) {
    if (currentScreen >= 4 && currentScreen <= 6) {
      int t = currentScreen - 4; 
      if (cursorIndex == 0) usbAngleA[t] = max(0, usbAngleA[t] - 1); 
      else usbAngleB[t] = max(0, usbAngleB[t] - 1); 
      drawScreen();
    } 
    else if (currentScreen == 8) { delayDisconnect = max(0, delayDisconnect - 1); drawScreen(); }
    else if (currentScreen == 9) { delayConnect = max(8, delayConnect - 1); drawScreen(); }
    delay(100);
  }

UPDATE_STATE:
  lastOk = ok; lastDown = down; lastPlus = plus; lastMinus = minus; lastRun = run;
}

// ==========================================
// LOCAL OTA SETUP
// ==========================================
void setupArduinoOTA() {
  ArduinoOTA.setHostname("ATE-Tool-System");

  // ArduinoOTA mặc định reboot sau update thành công. Set explicit để
  // đảm bảo cả firmware OTA và filesystem OTA đều reboot sau khi hoàn tất.
  // Sau reboot, setupAudio() sẽ mount lại LittleFS và các voice mới sẽ có hiệu lực.
  ArduinoOTA.setRebootOnSuccess(true);

  ArduinoOTA.onStart([]() {
    localOtaInProgress = true;
    localOtaFilesystemUpdate = (ArduinoOTA.getCommand() != U_FLASH);

    lcd.clear();

    if (localOtaFilesystemUpdate) {
      printCentered(0, "LITTLEFS OTA");
      lcd.setCursor(0, 1); lcd.print("Stopping Audio...");

      // QUAN TRỌNG:
      // 1) Chặn enqueue beep/voice mới.
      // 2) Đợi audio task đóng WAV đang phát.
      // 3) Sau đó mới unmount LittleFS.
      bool fsSafe = pauseAudioAndUnmountLittleFSForOta();

