smartcartech/SmartCarTech_Web/ate-automation/src/FW_v03.00.09_ESP32_3USB_3DLC_OTA.cpp
  if (WiFi.status() != WL_CONNECTED) {
    lcd.clear();
    lcd.setCursor(0, 1);
    lcd.print("No WiFi Connection!");
    queueVoice(VOICE_OTA_FAILED);
    delay(1500);
    return;
  }

  // ========================================================
  // 1) DOWNLOAD + PARSE version.json
  // ========================================================
  WiFiClientSecure manifestClient;
  manifestClient.setInsecure(); // Giữ nguyên policy HTTPS hiện tại của project.
  manifestClient.setTimeout(12000);

  HTTPClient http;
  if (!http.begin(manifestClient, version_url)) {
    lcd.clear();
    lcd.setCursor(0, 1); lcd.print("OTA URL Error!");
    queueVoice(VOICE_OTA_FAILED);
    delay(1500);
    return;
  }

  int httpCode = http.GET();

  if (httpCode != HTTP_CODE_OK) {
    lcd.clear();
    lcd.setCursor(0, 1);
    lcd.print("Server Error: ");
    lcd.print(httpCode);
    queueVoice(VOICE_OTA_FAILED);
    delay(1500);
    http.end();
    return;
  }

  String payload = http.getString();

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, payload);

  if (error) {
    lcd.clear();
    lcd.setCursor(0, 1);
    lcd.print("JSON Error!");
    queueVoice(VOICE_OTA_FAILED);
    delay(1500);
    http.end();
    return;
  }

  JsonVariant firmwareNode = doc["firmware"];
  JsonVariant filesystemNode = doc["filesystem"];

  if (!firmwareNode.is<JsonObject>() || !filesystemNode.is<JsonObject>()) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Invalid version.json");
    lcd.setCursor(0, 1); lcd.print("Missing FW/FS node");
    queueVoice(VOICE_OTA_FAILED);
    delay(2000);
    http.end();
    return;
  }

  JsonObject firmware = firmwareNode.as<JsonObject>();
  JsonObject filesystem = filesystemNode.as<JsonObject>();

  String newFwVersion = firmware["version"] | "";
  uint32_t newFwVersionCode = firmware["version_code"] | 0;
  String fwBinFile = firmware["bin_file"] | "";

  String newFsVersion = filesystem["version"] | "";
  uint32_t newFsVersionCode = filesystem["version_code"] | 0;
  String fsBinFile = filesystem["bin_file"] | "";

  if (newFwVersionCode == 0 || newFwVersion.length() == 0 || fwBinFile.length() == 0 ||
      newFsVersionCode == 0 || newFsVersion.length() == 0 || fsBinFile.length() == 0) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Invalid version.json");
    lcd.setCursor(0, 1); lcd.print("Missing OTA data!");
    queueVoice(VOICE_OTA_FAILED);
    delay(2000);
    http.end();
    return;
  }

  // Không cần giữ HTTP connection của manifest trong lúc flash binary.
  http.end();

  const bool needFwUpdate = (newFwVersionCode > CURRENT_VERSION_CODE);
  const bool needFsUpdate = (newFsVersionCode > installedFsVersionCode);

  USBSerial.println("[HTTPS-OTA] ===== VERSION CHECK =====");
  USBSerial.print("[HTTPS-OTA] FW current: ");
  USBSerial.print(CURRENT_VERSION);
  USBSerial.print(" ("); USBSerial.print(CURRENT_VERSION_CODE); USBSerial.println(")");
  USBSerial.print("[HTTPS-OTA] FW server : ");
  USBSerial.print(newFwVersion);
  USBSerial.print(" ("); USBSerial.print(newFwVersionCode); USBSerial.println(")");
  USBSerial.print("[HTTPS-OTA] FS current: ");
  USBSerial.print(versionCodeToName(installedFsVersionCode));
  USBSerial.print(" ("); USBSerial.print(installedFsVersionCode); USBSerial.println(")");
  USBSerial.print("[HTTPS-OTA] FS server : ");
  USBSerial.print(newFsVersion);
  USBSerial.print(" ("); USBSerial.print(newFsVersionCode); USBSerial.println(")");

  if (!needFwUpdate && !needFsUpdate) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Already Up To Date!");
    lcd.setCursor(0, 1); lcd.print("FW: "); lcd.print(CURRENT_VERSION);
    lcd.setCursor(0, 2); lcd.print("Voice: "); lcd.print(newFsVersion);
    delay(2500);
    return;
  }

  // QUAN TRỌNG: tắt auto reboot của HTTPUpdate để nếu cần update cả FW + FS,
  // ta chỉ reboot đúng một lần ở cuối.
  httpUpdate.rebootOnUpdate(false);

  bool fwUpdated = false;
  bool fsUpdated = false;
  bool fwUpdateFailed = false;
  bool fsUpdateFailed = false;

  // ========================================================
  // 2) FIRMWARE UPDATE - LÀM TRƯỚC
  // ========================================================
  if (needFwUpdate) {
    lcd.clear();
    printCentered(0, "UPDATE FIRMWARE");
    lcd.setCursor(0, 1); lcd.print(CURRENT_VERSION);
    lcd.print(" -> "); lcd.print(newFwVersion);
    lcd.setCursor(0, 2); lcd.print("Downloading FW...");

    String fwUrl = String(base_bin_url) + fwBinFile;

    WiFiClientSecure fwClient;
    fwClient.setInsecure();
    fwClient.setTimeout(12000);

    t_httpUpdate_return fwRet = httpUpdate.update(fwClient, fwUrl);

    if (fwRet == HTTP_UPDATE_OK) {
      fwUpdated = true;
      USBSerial.println("[HTTPS-OTA] Firmware update staged successfully");
    } else {
      fwUpdateFailed = true;

      lcd.clear();
      lcd.setCursor(0, 0); lcd.print("FW Update Failed!");
      lcd.setCursor(0, 1); lcd.print("Error: "); lcd.print(httpUpdate.getLastError());
      lcd.setCursor(0, 2); lcd.print(httpUpdate.getLastErrorString());

      USBSerial.print("[HTTPS-OTA] Firmware update failed: ");
      USBSerial.println(httpUpdate.getLastErrorString());

      queueVoice(VOICE_OTA_FAILED);
      delay(3000);
    }
  }

  // Nếu firmware BẮT BUỘC phải update nhưng lại fail thì không ghi filesystem mới.
  // Điều này tránh trường hợp filesystem mới yêu cầu firmware mới nhưng FW cũ vẫn chạy.
  bool safeToUpdateFs = (!needFwUpdate || fwUpdated);

  // ========================================================
  // 3) LITTLEFS / VOICE UPDATE
  // ========================================================
  if (needFsUpdate && safeToUpdateFs) {
    lcd.clear();
    printCentered(0, "UPDATE VOICE");
    lcd.setCursor(0, 1);
    lcd.print(versionCodeToName(installedFsVersionCode));
    lcd.print(" -> "); lcd.print(newFsVersion);
    lcd.setCursor(0, 2); lcd.print("Stopping Audio...");

    // Dùng chung cơ chế pause an toàn với Local LittleFS OTA:
    // - khóa request beep/voice mới
    // - dừng voice đang phát
    // - đóng WAV
    // - xác nhận audio task paused
    // - LittleFS.end()
    bool fsSafe = pauseAudioAndUnmountLittleFSForOta();

