smartcartech/SmartCarTech_Web/ate-automation/src/FW_v03.00.09_ESP32_3USB_3DLC_OTA.cpp
    if (!fsSafe) {
      fsUpdateFailed = true;
      lcd.clear();
      lcd.setCursor(0, 0); lcd.print("Voice OTA Failed!");
      lcd.setCursor(0, 1); lcd.print("Audio Stop Timeout");

      // Khôi phục audio state vì filesystem chưa bị ghi.
      resumeAudioAfterFilesystemOtaError();
      delay(2000);
    } else {
      lcd.setCursor(0, 2); lcd.print("Downloading Voice... ");

      String fsUrl = String(base_bin_url) + fsBinFile;

      WiFiClientSecure fsClient;
      fsClient.setInsecure();
      fsClient.setTimeout(12000);

      t_httpUpdate_return fsRet;

      // Arduino-ESP32 Core 2.0.17 chưa có updateLittlefs().
      // API legacy updateSpiffs() ghi raw filesystem image vào data partition
      // subtype SPIFFS; LittleFS trên core 2.x dùng cùng data partition subtype.
      fsRet = httpUpdate.updateSpiffs(fsClient, fsUrl);

      if (fsRet == HTTP_UPDATE_OK) {
        fsUpdated = true;

        // Ghi version vào EEPROM CHỈ SAU KHI filesystem image update thành công.
        // Nhờ vậy nếu download/flash lỗi, lần boot sau vẫn tự retry.
        saveInstalledFsVersion(newFsVersionCode);

        USBSerial.println("[HTTPS-OTA] LittleFS update successful");

        // Không remount LittleFS ở đây. Partition vừa được ghi xong và nếu có
        // update thành công ta sẽ reboot một lần ở cuối. setupAudio() ở boot mới
        // sẽ mount filesystem mới sạch sẽ.
      } else {
        fsUpdateFailed = true;

        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("Voice Update Failed!");
        lcd.setCursor(0, 1); lcd.print("Error: "); lcd.print(httpUpdate.getLastError());
        lcd.setCursor(0, 2); lcd.print(httpUpdate.getLastErrorString());

        USBSerial.print("[HTTPS-OTA] LittleFS update failed: ");
        USBSerial.println(httpUpdate.getLastErrorString());

        // Nếu update FS lỗi, thử mount lại KHÔNG FORMAT để hệ thống cũ vẫn có
        // thể tiếp tục dùng voice nếu filesystem còn nguyên vẹn.
        resumeAudioAfterFilesystemOtaError();
        delay(3000);
      }
    }
  }

  // Nếu FW fail, FS đã được chủ động skip.
  if (needFsUpdate && !safeToUpdateFs) {
    USBSerial.println("[HTTPS-OTA] Filesystem update skipped because firmware update failed");
  }

  // Khôi phục default của HTTPUpdate cho các lần gọi khác trong tương lai.
  httpUpdate.rebootOnUpdate(true);

  // ========================================================
  // 4) FINAL RESULT / REBOOT MỘT LẦN
  // ========================================================
  if (fwUpdated || fsUpdated) {
    lcd.clear();
    printCentered(0, "UPDATE DONE");

    lcd.setCursor(0, 1);
    lcd.print("FW: ");
    if (fwUpdated) lcd.print("Updated");
    else           lcd.print("No Change");

    lcd.setCursor(0, 2);
    lcd.print("Voice: ");
    if (fsUpdated) lcd.print("Updated");
    else if (fsUpdateFailed) lcd.print("Failed");
    else lcd.print("No Change");

    lcd.setCursor(0, 3); lcd.print("Rebooting...");

    // Nếu FW đã update nhưng FS fail, vẫn reboot vào FW mới. Vì FS version
    // chưa được save, boot kế tiếp sẽ tự retry filesystem từ server.
    delay(1500);
    ESP.restart();
    return;
  }

  // Không có update nào thành công.
  if (fwUpdateFailed || fsUpdateFailed) {
    lcd.clear();
    printCentered(0, "OTA FAILED");
    if (fwUpdateFailed) {
      lcd.setCursor(0, 1); lcd.print("Firmware: Failed");
    }
    if (fsUpdateFailed) {
      lcd.setCursor(0, 2); lcd.print("Voice: Failed");
    }
    lcd.setCursor(0, 3); lcd.print("Running old version");
    delay(2500);
    return;
  }
}

// ==========================================
// HTTPS OTA - FILESYSTEM VERSION METADATA
// ==========================================
String versionCodeToName(uint32_t versionCode) {
  if (versionCode == 0) return "00.00.00";

  uint32_t patch = versionCode % 100UL;
  uint32_t minor = (versionCode / 100UL) % 100UL;
  uint32_t major = versionCode / 10000UL;

  char buffer[16];
  snprintf(buffer, sizeof(buffer), "%02lu.%02lu.%02lu",
           (unsigned long)major,
           (unsigned long)minor,
           (unsigned long)patch);
  return String(buffer);
}

void loadInstalledFsVersion() {
  uint32_t magic = 0;
  uint32_t savedVersion = 0;

  EEPROM.get(addrFsVersionMagic, magic);
  EEPROM.get(addrFsVersionCode, savedVersion);

  if (magic == FS_VERSION_MAGIC) {
    installedFsVersionCode = savedVersion;
  } else {
    installedFsVersionCode = FACTORY_FS_VERSION_CODE;
  }

  USBSerial.print("[HTTPS-OTA] Installed FS version code: ");
  USBSerial.println(installedFsVersionCode);
}

void saveInstalledFsVersion(uint32_t versionCode) {
  EEPROM.put(addrFsVersionCode, versionCode);
  EEPROM.put(addrFsVersionMagic, FS_VERSION_MAGIC);
  EEPROM.commit();
  installedFsVersionCode = versionCode;

  USBSerial.print("[HTTPS-OTA] Saved FS version code: ");
  USBSerial.println(installedFsVersionCode);
}


void trigger11Keys() {
  for (int p = 0; p < 11; p++) {
    mcp.digitalWrite(p, LOW);  delay(200);                
    mcp.digitalWrite(p, HIGH); delay(200);                
  }
}

// ==========================================
// MÁY TRẠNG THÁI (HỖ TRỢ CẢ 2 CHẾ ĐỘ AUTO VÀ PC)
// ==========================================
void handleRunSequence() {
  unsigned long currentMillis = millis();
  
  switch(runStep) {
    case 2: 
      if (currentMillis - previousMillis >= delayDisconnect * 1000UL) { runStep = 3; }
      break;
      
    case 3: 
      usbServos[currentPair].attach(USB_SERVO_PINS[currentPair]);  
      usbServos[currentPair].write(usbAngleB[currentPair]);
      
      previousMillis = currentMillis; runStep = 4;
      if(isRunManually) { lcd.setCursor(0, 2); lcd.print("USB Connected..."); }
      break;
      
    case 4: 
      if (currentMillis - previousMillis >= 1000UL) {
        detachServoSafe(currentPair); 
        previousMillis = currentMillis; runStep = 5;
      }
      break;
      
    case 5: 
      if (currentMillis - previousMillis >= 1000UL) {
        mcp.digitalWrite(DLC_RELAY_PINS[currentPair], LOW); 
        runStep = 6; 
        previousMillis = currentMillis; 
        if (isRunManually) { lcd.setCursor(0, 2); lcd.print("DLC Connected..."); } 
        else { lcd.setCursor(0, 2); lcd.print("Waiting PC Command.."); }
      }
      break;
      
