smartcartech/SmartCarTech_Web/ate-automation/src/FW_v03.00.09_ESP32_3USB_3DLC_OTA.cpp
    case 6: 
      if (isRunManually) {
          // AUTO: giữ nguyên logic cũ. Tổng thời gian Delay Connect bao gồm
          // 4.4s test 11 keys + 3s chờ ở step 61.
          // AUTO2: không test key, vì vậy chờ đủ delayConnect rồi đổi Tool.
          unsigned long waitTime = 0;

          if (skipManualKeyTest) {
              waitTime = delayConnect * 1000UL;
          } else {
              if (delayConnect * 1000UL > 7400UL) {
                  waitTime = delayConnect * 1000UL - 7400UL;
              }
          }
          
          if (currentMillis - previousMillis >= waitTime) {
              if (skipManualKeyTest) {
                  runStep = 7;
                  lcd.setCursor(0, 2); lcd.print("Changing Tool...    ");
              } else {
                  lcd.setCursor(0, 2); lcd.print("Testing 11 Keys...  ");
                  trigger11Keys();
                  previousMillis = millis();
                  runStep = 61;
              }
          }
      }
      break;

    case 61: 
      if (isRunManually) {
          if (currentMillis - previousMillis >= 3000UL) {
              runStep = 7;
              lcd.setCursor(0, 2); lcd.print("Changing Tool...    ");
          }
      }
      break;

    case 7: 
      mcp.digitalWrite(DLC_RELAY_PINS[currentPair], HIGH); 
      previousMillis = currentMillis; runStep = 8;
      break;

    case 8:
      if (currentMillis - previousMillis >= 500UL) {
        usbServos[currentPair].attach(USB_SERVO_PINS[currentPair]);  
        usbServos[currentPair].write(usbAngleA[currentPair]); 
        previousMillis = currentMillis; runStep = 9;
      }
      break; 

    case 9:
      if (currentMillis - previousMillis >= 1000UL) {
        detachServoSafe(currentPair); 
        currentPair++;
        if (currentPair > 2) currentPair = 0; 
        lcd.setCursor(6, 1); lcd.print(currentPair + 1); 
        
        previousMillis = currentMillis; 
        runStep = 2; 
        lcd.setCursor(0, 2); lcd.print("Change Complete...  ");
        if (isRunManually) queueToolVoice(currentPair);
      }
      break;
  }
}

void safeStopAll() {
  lcd.clear();
  printCentered(1, "STOPPING SYSTEM...");
  for (int p = 0; p < 16; p++) { mcp.digitalWrite(p, HIGH); }
  for (int i = 0; i < 3; i++) {
    usbServos[i].attach(USB_SERVO_PINS[i]); 
    usbServos[i].write(usbAngleA[i]); 
    delay(500);                             
    detachServoSafe(i);
  }
}

void printCentered(int row, String text) {
  String paddedText = " " + text + " "; 
  int textLen = paddedText.length();
  int padding = (20 - textLen) / 2;
  if (padding <= 0) { lcd.setCursor(0, row); lcd.print(text); return; }
  lcd.setCursor(0, row);
  for (int i = 0; i < padding; i++) lcd.print("-"); 
  lcd.print(paddedText);
  for (int i = 0; i < (20 - textLen - padding); i++) lcd.print("-");
}

void drawScreen() {
  lcd.clear();
  if (currentScreen == 2) {
    printCentered(0, "Function");
    
    // Mảng chứa tên 5 mục Menu
    String menuItems[5] = {"Run Manually", "Servo Calibration", "Delay Connect", "Delay Disconnect", "Wifi Setting"};
    
    // Logic cuộn trang (Hiển thị 3 dòng từ startItem)
    int startItem = 0;
    if (cursorIndex > 2) {
        startItem = cursorIndex - 2;
    }
    
    for (int i = 0; i < 3; i++) {
        if (startItem + i < 5) {
            lcd.setCursor(1, i + 1);
            lcd.print(menuItems[startItem + i]);
        }
    }
    lcd.setCursor(0, cursorIndex - startItem + 1); lcd.print(">"); 
  }
  else if (currentScreen == 10) {
    printCentered(0, "Run Manually");
    lcd.setCursor(1, 1); lcd.print("Include Key Test");
    lcd.setCursor(1, 2); lcd.print("Skip Key Test");
    lcd.setCursor(0, cursorIndex + 1); lcd.print(">");
  } 
  else if (currentScreen >= 4 && currentScreen <= 6) {
    int t = currentScreen - 4; 
    String title = "Tool " + String(t + 1) + " Calib";
    printCentered(0, title);
    lcd.setCursor(1, 1); lcd.print("Angle A: "); lcd.print(usbAngleA[t]); lcd.print((char)223);
    lcd.setCursor(1, 2); lcd.print("Angle B: "); lcd.print(usbAngleB[t]); lcd.print((char)223);
    lcd.setCursor(0, cursorIndex + 1); lcd.print(">");
  } 
  else if (currentScreen == 8) {
    printCentered(0, "Delay Disconnect");
    lcd.setCursor(0, 1); lcd.print(delayDisconnect); lcd.print(" seconds");
  }
  else if (currentScreen == 9) {
    printCentered(0, "Delay Connect");
    lcd.setCursor(0, 1); lcd.print(delayConnect); lcd.print(" seconds");
  }
}


// ==========================================
// AUDIO - MAX98357A
// - Beep: chỉ cho DOWN / OK / + / - / RUN
// - Voice: sự kiện quan trọng / warning / error
// - Audio chạy trên FreeRTOS task riêng, không block ATE logic
// ==========================================
uint16_t readLE16(const uint8_t* p) {
  return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

uint32_t readLE32(const uint8_t* p) {
  return (uint32_t)p[0] |
         ((uint32_t)p[1] << 8) |
         ((uint32_t)p[2] << 16) |
         ((uint32_t)p[3] << 24);
}

void setupAudio() {
  // Arduino-ESP32 2.0.17 dùng legacy I2S driver (driver/i2s.h).
  // MAX98357A chỉ cần BCLK + WS/LRC + DOUT từ ESP32-S3.
  i2s_config_t i2sConfig = {};
  i2sConfig.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);
  i2sConfig.sample_rate = BUTTON_BEEP_SAMPLE_RATE;
  i2sConfig.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  i2sConfig.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
  i2sConfig.communication_format = I2S_COMM_FORMAT_STAND_I2S;
  i2sConfig.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  i2sConfig.dma_buf_count = 8;
  i2sConfig.dma_buf_len = 128;
  i2sConfig.use_apll = false;
  i2sConfig.tx_desc_auto_clear = true;
  i2sConfig.fixed_mclk = 0;
  i2sConfig.mclk_multiple = I2S_MCLK_MULTIPLE_DEFAULT;
  i2sConfig.bits_per_chan = I2S_BITS_PER_CHAN_DEFAULT;

  esp_err_t i2sErr = i2s_driver_install(AUDIO_I2S_PORT, &i2sConfig, 0, nullptr);
  if (i2sErr != ESP_OK) {
    USBSerial.print("[AUDIO] i2s_driver_install failed: ");
    USBSerial.println((int)i2sErr);
    audioI2SReady = false;
    return;
  }

  i2s_pin_config_t pinConfig = {};
  pinConfig.mck_io_num = I2S_PIN_NO_CHANGE;
  pinConfig.bck_io_num = I2S_BCLK_PIN;
  pinConfig.ws_io_num = I2S_LRC_PIN;
  pinConfig.data_out_num = I2S_DOUT_PIN;
  pinConfig.data_in_num = I2S_PIN_NO_CHANGE;

  i2sErr = i2s_set_pin(AUDIO_I2S_PORT, &pinConfig);
  if (i2sErr != ESP_OK) {
    USBSerial.print("[AUDIO] i2s_set_pin failed: ");
    USBSerial.println((int)i2sErr);
    i2s_driver_uninstall(AUDIO_I2S_PORT);
    audioI2SReady = false;
    return;
  }

  i2sErr = i2s_set_clk(
    AUDIO_I2S_PORT,
    BUTTON_BEEP_SAMPLE_RATE,
    I2S_BITS_PER_SAMPLE_16BIT,
    I2S_CHANNEL_MONO
  );
  if (i2sErr != ESP_OK) {
    USBSerial.print("[AUDIO] i2s_set_clk failed: ");
    USBSerial.println((int)i2sErr);
    i2s_driver_uninstall(AUDIO_I2S_PORT);
    audioI2SReady = false;
    return;
  }

